const questions = [
    { question: "เมืองหลวงของไทยคืออะไร?", options: ["กรุงเทพฯ", "เชียงใหม่", "ภูเก็ต", "สงขลา"], answer: "กรุงเทพฯ" },
    { question: "ประเทศใดที่มีประชากรมากที่สุดในโลก?", options: ["จีน", "อินเดีย", "สหรัฐอเมริกา", "ญี่ปุ่น"], answer: "จีน" },
    { question: "ทะเลทรายซาฮาราตั้งอยู่ในทวีปไหน?", options: ["เอเชีย", "แอฟริกา", "ยุโรป", "อเมริกาเหนือ"], answer: "แอฟริกา" },
    { question: "ประเทศใดที่มีพื้นที่ใหญ่ที่สุดในโลก?", options: ["รัสเซีย", "แคนาดา", "จีน", "สหรัฐอเมริกา"], answer: "รัสเซีย" },
    { question: "แม่น้ำไนล์ตั้งอยู่ในทวีปไหน?", options: ["เอเชีย", "แอฟริกา", "อเมริกาใต้", "ยุโรป"], answer: "แอฟริกา" },
    { question: "ประเทศไหนที่มีเกาะมากที่สุดในโลก?", options: ["อินโดนีเซีย", "ญี่ปุ่น", "ฟินแลนด์", "สวีเดน"], answer: "ฟินแลนด์" },
    { question: "ทวีปไหนที่มีพื้นที่เล็กที่สุดในโลก?", options: ["แอฟริกา", "อเมริกาใต้", "ยุโรป", "โอเชียเนีย"], answer: "โอเชียเนีย" },
    { question: "เมืองที่มีประชากรมากที่สุดในโลกคือเมืองไหน?", options: ["โตเกียว", "เซี่ยงไฮ้", "กรุงจาการ์ตา", "มุมไบ"], answer: "โตเกียว" },
    { question: "ประเทศใดในยุโรปที่ไม่มีทะเล?", options: ["สวิตเซอร์แลนด์", "ฝรั่งเศส", "เยอรมนี", "อิตาลี"], answer: "สวิตเซอร์แลนด์" },
    { question: "ประเทศไหนในอเมริกาที่ไม่ได้พูดภาษาสเปน?", options: ["เม็กซิโก", "เปรู", "บราซิล", "โคลอมเบีย"], answer: "บราซิล" },
    {
        question: "เมืองหลวงของไทยคืออะไร?",
        options: ["กรุงเทพฯ", "เชียงใหม่", "ภูเก็ต", "สงขลา"],
        answer: "กรุงเทพฯ"
    },
    {
        question: "ประเทศใดที่มีประชากรมากที่สุดในโลก?",
        options: ["จีน", "อินเดีย", "สหรัฐอเมริกา", "ญี่ปุ่น"],
        answer: "จีน"
    },
    {
        question: "ทะเลทรายซาฮาราตั้งอยู่ในทวีปไหน?",
        options: ["เอเชีย", "แอฟริกา", "ยุโรป", "อเมริกาเหนือ"],
        answer: "แอฟริกา"
    },
    {
        question: "ประเทศใดที่มีพื้นที่ใหญ่ที่สุดในโลก?",
        options: ["รัสเซีย", "แคนาดา", "จีน", "สหรัฐอเมริกา"],
        answer: "รัสเซีย"
    },
    {
        question: "แม่น้ำไนล์ตั้งอยู่ในทวีปไหน?",
        options: ["เอเชีย", "แอฟริกา", "อเมริกาใต้", "ยุโรป"],
        answer: "แอฟริกา"
    },
    {
        question: "ประเทศไหนที่มีเกาะมากที่สุดในโลก?",
        options: ["อินโดนีเซีย", "ญี่ปุ่น", "ฟินแลนด์", "สวีเดน"],
        answer: "ฟินแลนด์"
    },
    {
        question: "ทวีปไหนที่มีพื้นที่เล็กที่สุดในโลก?",
        options: ["แอฟริกา", "อเมริกาใต้", "ยุโรป", "โอเชียเนีย"],
        answer: "โอเชียเนีย"
    },
    {
        question: "เมืองที่มีประชากรมากที่สุดในโลกคือเมืองไหน?",
        options: ["โตเกียว", "เซี่ยงไฮ้", "กรุงจาการ์ตา", "มุมไบ"],
        answer: "โตเกียว"
    },
    {
        question: "ประเทศใดในยุโรปที่ไม่มีทะเล?",
        options: ["สวิตเซอร์แลนด์", "ฝรั่งเศส", "เยอรมนี", "อิตาลี"],
        answer: "สวิตเซอร์แลนด์"
    },
    {
        question: "ประเทศไหนในอเมริกาที่ไม่ได้พูดภาษาสเปน?",
        options: ["เม็กซิโก", "เปรู", "บราซิล", "โคลอมเบีย"],
        answer: "บราซิล"
    },
    {
        question: "อุทยานแห่งชาติที่ใหญ่ที่สุดในสหรัฐอเมริกาคือที่ไหน?",
        options: ["Yellowstone", "Grand Canyon", "Yosemite", "Zion"],
        answer: "Yellowstone"
    },
    {
        question: "เมืองที่เป็นศูนย์กลางการค้าของโลกคือเมืองไหน?",
        options: ["นิวยอร์ก", "ลอนดอน", "ฮ่องกง", "โตเกียว"],
        answer: "ลอนดอน"
    },
    {
        question: "ทะเลที่ใหญ่ที่สุดในโลกคือทะเลไหน?",
        options: ["ทะเลบอลติก", "ทะเลจีนใต้", "ทะเลแคริบเบียน", "ทะเลแดง"],
        answer: "ทะเลจีนใต้"
    },
    {
        question: "ประเทศที่มีความยาวชายฝั่งทะเลมากที่สุดคือที่ไหน?",
        options: ["แคนาดา", "ออสเตรเลีย", "นอร์เวย์", "สหรัฐอเมริกา"],
        answer: "แคนาดา"
    },
    {
        question: "แม่น้ำที่ยาวที่สุดในโลกคือแม่น้ำไหน?",
        options: ["แม่น้ำไนล์", "แม่น้ำอเมซอน", "แม่น้ำยานซี", "แม่น้ำมิสซิสซิปปี"],
        answer: "แม่น้ำไนล์"
    },
    {
        question: "ประเทศที่มีประชากรน้อยที่สุดในโลกคือที่ไหน?",
        options: ["วาติกัน", "โมนาโก", "ซานมารีโน", "ลิกเตนสไตน์"],
        answer: "วาติกัน"
    },
    {
        question: "เมืองหลวงของออสเตรเลียคือที่ไหน?",
        options: ["ซิดนีย์", "เมลเบิร์น", "แคนเบอร์รา", "โฮบาร์ต"],
        answer: "แคนเบอร์รา"
    },
    {
        question: "ประเทศที่ใหญ่ที่สุดในแอฟริกาคือที่ไหน?",
        options: ["แอลจีเรีย", "นิเชอเรีย", "อียิปต์", "แอฟริกาใต้"],
        answer: "แอลจีเรีย"
    },
    {
        question: "จุดที่ต่ำที่สุดในโลกคือที่ไหน?",
        options: ["แหล่งน้ำเกลือที่ทะเลเดดซี", "หุบเขาแกรนด์แคนยอน", "ทุ่งหญ้าซาฟารี", "ทะเลทรายโมฮาฟ"],
        answer: "แหล่งน้ำเกลือที่ทะเลเดดซี"
    },
    {
        question: "ประเทศไหนในยุโรปที่มีภูเขาที่สูงที่สุดในทวีปยุโรป?",
        options: ["สวิตเซอร์แลนด์", "ฝรั่งเศส", "อิตาลี", "ออสเตรีย"],
        answer: "ฝรั่งเศส"
    },
    {
        question: "ประเทศที่มีทะเลทรายที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["ออสเตรเลีย", "สหรัฐอเมริกา", "แอฟริกาใต้", "อียิปต์"],
        answer: "ออสเตรเลีย"
    },
    {
        question: "มหาสมุทรที่ใหญ่ที่สุดในโลกคือมหาสมุทรไหน?",
        options: ["มหาสมุทรแอตแลนติก", "มหาสมุทรแปซิฟิก", "มหาสมุทรอินเดีย", "มหาสมุทรอาร์กติก"],
        answer: "มหาสมุทรแปซิฟิก"
    },
    {
        question: "ประเทศไหนที่มีชื่อเป็นที่รู้จักในนาม 'ดินแดนแห่งดอกไม้'?",
        options: ["เนเธอร์แลนด์", "เบลเยียม", "เยอรมนี", "ฝรั่งเศส"],
        answer: "เนเธอร์แลนด์"
    },
    {
        question: "ทวีปไหนที่มีจำนวนประเทศมากที่สุด?",
        options: ["แอฟริกา", "ยุโรป", "เอเชีย", "อเมริกาเหนือ"],
        answer: "แอฟริกา"
    },
    {
        question: "ภูเขาเอเวอเรสต์ตั้งอยู่ในประเทศไหน?",
        options: ["เนปาล", "อินเดีย", "จีน", "ปากีสถาน"],
        answer: "เนปาล"
    },
    {
        question: "หมู่เกาะไหนที่อยู่ในมหาสมุทรแปซิฟิก?",
        options: ["หมู่เกาะกาลาปากอส", "หมู่เกาะฮาวาย", "หมู่เกาะบาฮามาส", "หมู่เกาะฟิจิ"],
        answer: "หมู่เกาะฮาวาย"
    },
    {
        question: "ประเทศที่ตั้งอยู่บนเกาะใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["ออสเตรเลีย", "กรีนแลนด์", "นิวซีแลนด์", "ไอซ์แลนด์"],
        answer: "กรีนแลนด์"
    },
    {
        question: "เมืองหลวงของสหรัฐอเมริกาคือที่ไหน?",
        options: ["นิวยอร์ก", "ลอสแอนเจลิส", "วอชิงตัน ดี.ซี.", "ซานฟรานซิสโก"],
        answer: "วอชิงตัน ดี.ซี."
    },
    {
        question: "เมืองหลวงของสหรัฐอเมริกาคือที่ไหน?",
        options: ["นิวยอร์ก", "ลอสแอนเจลิส", "วอชิงตัน ดี.ซี.", "ซานฟรานซิสโก"],
        answer: "วอชิงตัน ดี.ซี."
    },
    {
        question: "ประเทศที่เป็นผู้ผลิตน้ำมันมากที่สุดในโลกคือที่ไหน?",
        options: ["ซาอุดิอาระเบีย", "รัสเซีย", "สหรัฐอเมริกา", "อิหร่าน"],
        answer: "ซาอุดิอาระเบีย"
    },
    {
        question: "ภูเขาโอลิมปัสที่สูงที่สุดในประเทศกรีซคือภูเขาไหน?",
        options: ["ภูเขาโอลิมปัส", "ภูเขาเอเวอเรสต์", "ภูเขาเคลิมันจาโร", "ภูเขาแมทธิว"],
        answer: "ภูเขาโอลิมปัส"
    },
    {
        question: "เมืองหลวงของประเทศสเปนคือที่ไหน?",
        options: ["บาร์เซโลนา", "มาดริด", "เซบียา", "บิลเบา"],
        answer: "มาดริด"
    },
    {
        question: "ประเทศใดที่มีเมืองที่ใหญ่ที่สุดในยุโรป?",
        options: ["ฝรั่งเศส", "เยอรมนี", "อังกฤษ", "อิตาลี"],
        answer: "ฝรั่งเศส"
    },
    {
        question: "ประเทศที่มีชายฝั่งทะเลที่สั้นที่สุดในโลกคือที่ไหน?",
        options: ["โมนาโก", "วาติกัน", "ซานมารีโน", "ลิกเตนสไตน์"],
        answer: "โมนาโก"
    },
    {
        question: "ทวีปที่มีประชากรน้อยที่สุดคือทวีปไหน?",
        options: ["เอเชีย", "อเมริกาเหนือ", "ยุโรป", "แอนตาร์กติกา"],
        answer: "แอนตาร์กติกา"
    },
    {
        question: "เมืองที่เป็นศูนย์กลางทางการเงินสำคัญในสวิตเซอร์แลนด์คือเมืองไหน?",
        options: ["เจนีวา", "ซูริก", "บาเซิล", "ลูเซิร์น"],
        answer: "ซูริก"
    },
    {
        question: "ประเทศที่มีภูเขาไฟที่ยังคุกรุ่นอยู่หลายแห่งในทวีปเอเชียคือที่ไหน?",
        options: ["อินโดนีเซีย", "ฟิลิปปินส์", "ญี่ปุ่น", "ไทย"],
        answer: "อินโดนีเซีย"
    },
    {
        question: "พื้นที่ที่ต่ำที่สุดในประเทศออสเตรเลียคือที่ไหน?",
        options: ["ทะเลสาบอายร์", "ภูเขาเพลซ", "หุบเขาฮุท", "ทะเลสาบแคนเบอร์รา"],
        answer: "ทะเลสาบอายร์"
    },
    {
        question: "ประเทศที่มีชื่อเป็นที่รู้จักในนาม 'ดินแดนแห่งน้ำแข็ง' คือที่ไหน?",
        options: ["ไอซ์แลนด์", "กรีนแลนด์", "แคนาดา", "นอร์เวย์"],
        answer: "ไอซ์แลนด์"
    },
    {
        question: "เมืองที่มีชื่อเสียงจากการผลิตไวน์ในประเทศฝรั่งเศสคือเมืองไหน?",
        options: ["ปารีส", "ลียง", "บอร์โด", "นีซ"],
        answer: "บอร์โด"
    },
    {
        question: "ประเทศที่มีเกาะที่ใหญ่ที่สุดในมหาสมุทรแปซิฟิกคือที่ไหน?",
        options: ["ออสเตรเลีย", "ฟิจิ", "ฮาวาย", "นิวซีแลนด์"],
        answer: "ออสเตรเลีย"
    },
    {
        question: "ประเทศไหนที่มีภูเขาไฟที่สูงที่สุดในโลก?",
        options: ["เอกวาดอร์", "ญี่ปุ่น", "ชิลี", "ออสเตรเลีย"],
        answer: "เอกวาดอร์"
    },
    {
        question: "ประเทศที่มีระบบการขนส่งที่ดีที่สุดในโลกคือที่ไหน?",
        options: ["สวีเดน", "เยอรมนี", "สิงคโปร์", "ญี่ปุ่น"],
        answer: "ญี่ปุ่น"
    },  
    {
        question: "พื้นที่ป่าไม้ที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["ป่าอะเมซอน", "ป่าทะเลทรายซาฮารา", "ป่าฝนทางตะวันออกเฉียงใต้เอเชีย", "ป่าไทเกอร์"],
        answer: "ป่าอะเมซอน"
    },
    {
        question: "เมืองหลวงของประเทศอิตาลีคือที่ไหน?",
        options: ["ฟลอเรนซ์", "เวนิส", "โรม", "มิลาน"],
        answer: "โรม"
    },
    {
        question: "ทะเลที่แยกทวีปยุโรปออกจากทวีปเอเชียคือทะเลไหน?",
        options: ["ทะเลบอลติก", "ทะเลเมดิเตอร์เรเนียน", "ทะเลดำ", "ทะเลไอซ์แลนด์"],
        answer: "ทะเลดำ"
    },
    {
        question: "เมืองที่เป็นศูนย์กลางเทคโนโลยีสำคัญในสหรัฐอเมริกาคือเมืองไหน?",
        options: ["ลอสแอนเจลิส", "ซานฟรานซิสโก", "นิวยอร์ก", "ซีแอตเทิล"],
        answer: "ซานฟรานซิสโก"
    },
    {
        question: "ประเทศที่มีทุ่งหญ้าที่กว้างใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "อาร์เจนตินา", "แคนาดา", "แอฟริกาใต้"],
        answer: "แคนาดา"
    },
    {
        question: "ทวีปที่มีภูเขาที่สูงที่สุดในโลกคือทวีปไหน?",
        options: ["เอเชีย", "อเมริกาใต้", "ยุโรป", "แอฟริกา"],
        answer: "เอเชีย"
    },
    {
        question: "ประเทศที่มีอัตราการเกิดที่สูงที่สุดในโลกคือที่ไหน?",
        options: ["อินเดีย", "นอร์เวย์", "ประเทศสหรัฐอเมริกา", "ประเทศไนจีเรีย"],
        answer: "ประเทศไนจีเรีย"
    },
    {
        question: "เมืองที่มีสนามบินที่ยุ่งที่สุดในโลกคือที่ไหน?",
        options: ["สนามบินฮาเนดะ", "สนามบินฮาร์ทส์ฟิลด์แจ็กสัน", "สนามบินชางงี", "สนามบินลอสแอนเจลิส"],
        answer: "สนามบินฮาร์ทส์ฟิลด์แจ็กสัน"
    },
    {
        question: "ประเทศที่มีเมืองหลวงในทวีปอเมริกาคือที่ไหน?",
        options: ["เม็กซิโก", "บราซิล", "อาร์เจนตินา", "สหรัฐอเมริกา"],
        answer: "เม็กซิโก"
    },
    {
        question: "ประเทศที่มีการปลูกข้าวมากที่สุดในโลกคือที่ไหน?",
        options: ["อินเดีย", "เวียดนาม", "ไทย", "จีน"],
        answer: "จีน"
    },
    {
        question: "ทวีปที่มีประเทศที่ใหญ่ที่สุดในโลกคือทวีปไหน?",
        options: ["เอเชีย", "อเมริกาเหนือ", "แอฟริกา", "ยุโรป"],
        answer: "เอเชีย"
    },
    {
        question: "ประเทศที่มีภาษาราชการหลายภาษาที่สุดในโลกคือที่ไหน?",
        options: ["สวิตเซอร์แลนด์", "เบลเยียม", "อินเดีย", "แคนาดา"],
        answer: "อินเดีย"
    },
    {
        question: "แม่น้ำที่มีความยาวที่สุดในทวีปเอเชียคือแม่น้ำไหน?",
        options: ["แม่น้ำยานซี", "แม่น้ำโกงกาง", "แม่น้ำอินดัส", "แม่น้ำแม่โขง"],
        answer: "แม่น้ำยานซี"
    },
    {
        question: "ประเทศที่มีอากาศหนาวเย็นที่สุดในโลกคือที่ไหน?",
        options: ["รัสเซีย", "แคนาดา", "นอร์เวย์", "สวีเดน"],
        answer: "รัสเซีย"
    },
    {
        question: "ทะเลที่กว้างที่สุดในยุโรปคือทะเลไหน?",
        options: ["ทะเลบอลติก", "ทะเลเมดิเตอร์เรเนียน", "ทะเลเหนือ", "ทะเลดำ"],
        answer: "ทะเลบอลติก"
    },
    {
        question: "ประเทศที่เป็นแหล่งผลิตกาแฟหลักในโลกคือที่ไหน?",
        options: ["บราซิล", "โคลอมเบีย", "เวียดนาม", "อินโดนีเซีย"],
        answer: "บราซิล"
    },
    {
        question: "เมืองหลวงของประเทศซาอุดิอาระเบียคือที่ไหน?",
        options: ["เจดดาห์", "ริยาด", "ดัมมัม", "มักกะ"],
        answer: "ริยาด"
    },
    {
        question: "ประเทศที่เป็นแหล่งน้ำพุร้อนมากที่สุดในโลกคือที่ไหน?",
        options: ["ญี่ปุ่น", "ไอซ์แลนด์", "นิวซีแลนด์", "สหรัฐอเมริกา"],
        answer: "ไอซ์แลนด์"
    },
    {
        question: "เมืองที่มีสถาปัตยกรรมที่โด่งดังในยุโรปคือเมืองไหน?",
        options: ["ปารีส", "เวนิส", "ลอนดอน", "บาร์เซโลนา"],
        answer: "ปารีส"
    },
    {
        question: "ประเทศที่มีสนามกีฬาที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "จีน", "บราซิล", "อาร์เจนตินา"],
        answer: "สหรัฐอเมริกา"
    },
    {
        question: "พื้นที่ที่มีความชื้นสูงที่สุดในโลกคือที่ไหน?",
        options: ["ป่าฝนอะเมซอน", "แอนตาร์กติกา", "ทะเลทรายซาฮารา", "ซีกหิมะ"],
        answer: "ป่าฝนอะเมซอน"
    },
    {
        question: "ประเทศที่เป็นผู้ผลิตช็อกโกแลตใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["เบลเยียม", "สวิตเซอร์แลนด์", "สหรัฐอเมริกา", "ฝรั่งเศส"],
        answer: "เบลเยียม"
    },
    {
        question: "ภูเขาที่ตั้งอยู่ในประเทศแคนาดาคือภูเขาไหน?",
        options: ["ภูเขาแม็คเคนซี", "ภูเขาร็อกกี้", "ภูเขาอลป์", "ภูเขาแองเกิล"],
        answer: "ภูเขาแม็คเคนซี"
    },
    {
        question: "ประเทศที่มีทรัพยากรน้ำมันมากที่สุดในตะวันออกกลางคือที่ไหน?",
        options: ["ซาอุดิอาระเบีย", "อิรัก", "อิหร่าน", "คูเวต"],
        answer: "ซาอุดิอาระเบีย"
    },
    {
        question: "เมืองที่เป็นจุดหมายปลายทางที่มีการท่องเที่ยวสูงสุดในเอเชียคือเมืองไหน?",
        options: ["โตเกียว", "เซี่ยงไฮ้", "กรุงเทพฯ", "ฮ่องกง"],
        answer: "กรุงเทพฯ"
    },
    {
        question: "ประเทศที่มีการผลิตรถยนต์มากที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "ญี่ปุ่น", "เยอรมนี", "เกาหลีใต้"],
        answer: "ญี่ปุ่น"
    },
    {
        question: "ประเทศที่มีเกาะที่สวยงามและเป็นที่รู้จักกันดีในทวีปโอเชียเนียคือที่ไหน?",
        options: ["ฟิจิ", "นิวซีแลนด์", "ออสเตรเลีย", "ปาปัวนิวกินี"],
        answer: "ฟิจิ"
    },
    {
        question: "ประเทศที่เป็นแหล่งผลิตชาสำคัญในเอเชียคือที่ไหน?",
        options: ["จีน", "อินเดีย", "ศรีลังกา", "ไทย"],
        answer: "จีน"
    },
    {
        question: "เมืองที่เป็นศูนย์กลางการค้าในประเทศออสเตรเลียคือเมืองไหน?",
        options: ["ซิดนีย์", "เมลเบิร์น", "แคนเบอร์รา", "โฮบาร์ต"],
        answer: "ซิดนีย์"
    },
    {
        question: "ประเทศที่เป็นแหล่งปลูกดอกไม้ที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["เนเธอร์แลนด์", "ฝรั่งเศส", "ญี่ปุ่น", "สหรัฐอเมริกา"],
        answer: "เนเธอร์แลนด์"
    },
    {
        question: "พื้นที่ที่มีการเกษตรมากที่สุดในโลกคือที่ไหน?",
        options: ["ประเทศจีน", "สหรัฐอเมริกา", "อินเดีย", "บราซิล"],
        answer: "สหรัฐอเมริกา"
    },
    {
        question: "ประเทศที่มีการพัฒนาเทคโนโลยีโทรคมนาคมมากที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "เกาหลีใต้", "ญี่ปุ่น", "สวีเดน"],
        answer: "เกาหลีใต้"
    },
    {
        question: "ทะเลที่มีความเค็มมากที่สุดในโลกคือทะเลไหน?",
        options: ["ทะเลเดดซี", "ทะเลแดง", "ทะเลบอลติก", "ทะเลอ่าว"],
        answer: "ทะเลเดดซี"
    },
    {
        question: "ประเทศที่มีประชากรมากที่สุดในยุโรปคือที่ไหน?",
        options: ["รัสเซีย", "เยอรมนี", "ฝรั่งเศส", "สหราชอาณาจักร"],
        answer: "รัสเซีย"
    },
    {
        question: "เมืองที่เป็นศูนย์กลางการผลิตเสื้อผ้าในประเทศอินเดียคือเมืองไหน?",
        options: ["มุมไบ", "เดลี", "บังคาลอร์", "โกลกาตา"],
        answer: "มุมไบ"
    },
    {
        question: "ประเทศที่มีการพัฒนาเทคโนโลยีการเกษตรมากที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "เนเธอร์แลนด์", "อิสราเอล", "ออสเตรเลีย"],
        answer: "เนเธอร์แลนด์"
    },
    {
        question: "ประเทศที่มีเกาะมากที่สุดในโลกคือที่ไหน?",
        options: ["สวีเดน", "ฟินแลนด์", "ญี่ปุ่น", "นอร์เวย์"],
        answer: "ฟินแลนด์"
    },
    {
        question: "ประเทศที่มีทุ่งหญ้าที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "อาร์เจนตินา", "บราซิล", "แคนาดา"],
        answer: "แคนาดา"
    },
    {
        question: "เมืองที่มีหอไอเฟลตั้งอยู่คือเมืองไหน?",
        options: ["ปารีส", "ลอนดอน", "เบอร์ลิน", "มาดริด"],
        answer: "ปารีส"
    },
    {
        question: "ประเทศที่มีการผลิตแร่ธาตุมากที่สุดในโลกคือที่ไหน?",
        options: ["แอฟริกาใต้", "ออสเตรเลีย", "รัสเซีย", "สหรัฐอเมริกา"],
        answer: "ออสเตรเลีย"
    },
    {
        question: "ประเทศที่มีหอคอยที่สูงที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "ดูไบ", "จีน", "ญี่ปุ่น"],
        answer: "ดูไบ"
    },
    {
        question: "ประเทศที่มีเมืองที่ใหญ่ที่สุดในโลกตามจำนวนประชากรคือที่ไหน?",
        options: ["ญี่ปุ่น", "จีน", "อินเดีย", "บราซิล"],
        answer: "จีน"
    },
    {
        question: "เมืองที่เป็นที่ตั้งของมหาวิทยาลัยฮาร์วาร์ดคือที่ไหน?",
        options: ["บอสตัน", "นิวยอร์ก", "ชิคาโก", "ลอสแอนเจลิส"],
        answer: "บอสตัน"
    },
    {
        question: "ประเทศที่มีเศรษฐกิจใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["สหรัฐอเมริกา", "จีน", "ญี่ปุ่น", "เยอรมนี"],
        answer: "สหรัฐอเมริกา"
    },
    {
        question: "ประเทศที่มีธารน้ำแข็งที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["กรีนแลนด์", "แอนตาร์กติกา", "แคนาดา", "นอร์เวย์"],
        answer: "แอนตาร์กติกา"
    },
    {
        question: "ประเทศที่มีป่าฝนเขตร้อนที่ใหญ่ที่สุดในโลกคือที่ไหน?",
        options: ["บราซิล", "คองโก", "อินโดนีเซีย", "เวียดนาม"],
        answer: "บราซิล"
    },
    {
        question: "ประเทศที่มีชายฝั่งทะเลที่ยาวที่สุดในโลกคือที่ไหน?",
        options: ["แคนาดา", "ออสเตรเลีย", "รัสเซีย", "สหรัฐอเมริกา"],
        answer: "แคนาดา"
    }
    // เพิ่มคำถามอื่น ๆ ต่อไปจนถึง 100 ข้อ
];
